## Задача 12
#Скласти програму, яка переводить час із секунд, визначаючи повну кількість годин хвилин і секунд.
#Наприклад, час 5000 секунд це 1 година 23 хвилини 20 секунд 5000=13600+2360+20.

# Input - 5000
# Otput_hours - 1
# Otput_minutes - 23
# Otput_seconds - 20

time = int(input('Enter time period in seconds : '))
hours = time // 3600                # Ділимо без остачі кількість число на 3600 (кількість секунд в часі)
minutes = (time - 3600*hours) // 60 # Віднімаємо від загального часу розраховані години і ділимо без остачі на 60
seconds = time % 60                 # Визначаємо залишок від ділення загального часу на 60. Визначаємо секунди.  

print(f'Hours: {hours}, minutes: {minutes}, seconds: {seconds}')
