'''

Скласти програму, яка вводить з клавіатури тризначне число і виводить на екран
суму останньої та передостанньої цифри
суму останньої та першої цифри.

'''

# Input - 123
# Output_one - 5
# Output_two - 4

num = int(input('Enter three-digit number :'))

num_1 = num // 100 #Ділимо без остачі на 100: 123/100 буде 1.
num_2 = (num // 10) % 10 #Ділимо без остачі на 10: 123/10 буде 12. Потім беремо залишок від ділення 12 на 10. Буде 2.
num_3 = num % 10 #Беремо залишок від ділення 123 на 10. Буде 3.

print('num_1 = ', num_1)
print('num_2 = ', num_2)
print('num_3 = ', num_3)

sum_2_3 = num_2 + num_3
sum_1_3 = num_1 + num_3

print('Сума другоі і третьої цифри : ',  sum_2_3)
print('Сума першої і третьої цифри : ',  sum_1_3) 